In [2]:
import pandas as pd

In [3]:
df = pd.read_excel("excel_data.xlsx")
df

      ID       Name   Age         Profession  salary
0      1     olivia  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500   Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [4]:
df.shape # gives the datasets rows and columns in tuple --> (rows,columns)

(500, 5)

In [5]:
df.head() # df.head(n) gives top n rows default n is 5

   ID       Name   Age   Profession  salary
0   1     olivia  23.0      Teacher  184518
1   2  sophia     20.0        Boxer  119572
2   3       jake  38.0    Scientist  174897
3   4      Rocky  56.0         Chef  117920
4   4      Rocky  56.0         Chef  117920

In [6]:
df.head(8) # gives top 8 rows

   ID       Name   Age   Profession  salary
0   1     olivia  23.0      Teacher  184518
1   2  sophia     20.0        Boxer  119572
2   3       jake  38.0    Scientist  174897
3   4      Rocky  56.0         Chef  117920
4   4      Rocky  56.0         Chef  117920
5   4      Rocky  56.0         Chef  117920
6   4      Rocky  56.0         Chef  117920
7   4      Rocky  56.0         Chef  117920

In [7]:
df.tail() # df.tail(n) gives bottom n rows default n is 5

      ID      Name   Age         Profession  salary
495  496      John  45.0              Boxer  137929
496  497  Sherlock  46.0              Boxer   39870
497  498  Sherlock  47.0          Detective  165951
498  499    Olivia  55.0           Comedian  192618
499  500  Sherlock  59.0  Software Engineer  194886

In [8]:
df.tail(9) # gives bottom 9 rows

      ID      Name   Age         Profession  salary
491  492      Emma  34.0             Artist  145412
492  493      John  55.0             Artist   57720
493  494    Sophia  39.0             Doctor  174500
494  495     Rocky  27.0             Doctor   46975
495  496      John  45.0              Boxer  137929
496  497  Sherlock  46.0              Boxer   39870
497  498  Sherlock  47.0          Detective  165951
498  499    Olivia  55.0           Comedian  192618
499  500  Sherlock  59.0  Software Engineer  194886

In [9]:
# this is a random sample from the data
df.sample() # default is one random sample, if df.sample(n) then gives n random samples from the data

      ID      Name   Age Profession  salary
380  381  Sherlock  49.0   Comedian  119581

In [10]:
df.sample(3)

      ID   Name   Age   Profession  salary
260  261  Alice  26.0        Pilot  133759
50    51   Liam  42.0        Pilot  105830
314  315   Emma  46.0        Boxer  133014

In [11]:
df["Profession"] # Gives Profession column data

0                Teacher
1                  Boxer
2              Scientist
3                   Chef
4                   Chef
             ...
495                Boxer
496                Boxer
497            Detective
498             Comedian
499    Software Engineer
Name: Profession, Length: 500, dtype: object

In [12]:
df["Age"] # gives age column data

0      23.0
1      20.0
2      38.0
3      56.0
4      56.0
       ...
495    45.0
496    46.0
497    47.0
498    55.0
499    59.0
Name: Age, Length: 500, dtype: float64

In [13]:
# selecting more than one column data
df[['Name','Profession','salary']]

          Name         Profession  salary
0       olivia            Teacher  184518
1    sophia                 Boxer  119572
2         jake          Scientist  174897
3        Rocky               Chef  117920
4        Rocky               Chef  117920
..         ...                ...     ...
495       John              Boxer  137929
496   Sherlock              Boxer   39870
497   Sherlock          Detective  165951
498     Olivia           Comedian  192618
499   Sherlock  Software Engineer  194886

[500 rows x 3 columns]

In [14]:
# Rename the column name
# renaming single column
df_col_rename = df.rename(columns = {'Profession':'Occupation'})
df_col_rename

      ID       Name   Age         Occupation  salary
0      1     olivia  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500   Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [15]:
# renaming multiple columns
df_rename = df.rename(columns = {'Name':"Full Name",'salary':"Income",'Profession':"Occupation"})
df_rename

      ID  Full Name   Age         Occupation  Income
0      1     olivia  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500   Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

### Inserting/Updation new column in the dataframe

In [18]:
df1 = df.copy()
df1['salary'] = 10000000
df1

      ID       Name   Age         Profession    salary
0      1     olivia  23.0            Teacher  10000000
1      2  sophia     20.0              Boxer  10000000
2      3       jake  38.0          Scientist  10000000
3      4      Rocky  56.0               Chef  10000000
4      4      Rocky  56.0               Chef  10000000
..   ...        ...   ...                ...       ...
495  496       John  45.0              Boxer  10000000
496  497   Sherlock  46.0              Boxer  10000000
497  498   Sherlock  47.0          Detective  10000000
498  499     Olivia  55.0           Comedian  10000000
499  500   Sherlock  59.0  Software Engineer  10000000

[500 rows x 5 columns]

In [20]:
# syntax: dataframe_name[col_name] = value if the col_name already exist then it will update the column with value,
# but if the column does not exist then it will insert a new column with the given column name and with the assigned value.
df1["salary"] = 10000000 # update
df1["updated_salary"] = 1000 # inserted new column
df1

      ID       Name   Age         Profession    salary  updated_salary
0      1     olivia  23.0            Teacher  10000000            1000
1      2  sophia     20.0              Boxer  10000000            1000
2      3       jake  38.0          Scientist  10000000            1000
3      4      Rocky  56.0               Chef  10000000            1000
4      4      Rocky  56.0               Chef  10000000            1000
..   ...        ...   ...                ...       ...             ...
495  496       John  45.0              Boxer  10000000            1000
496  497   Sherlock  46.0              Boxer  10000000            1000
497  498   Sherlock  47.0          Detective  10000000            1000
498  499     Olivia  55.0           Comedian  10000000            1000
499  500   Sherlock  59.0  Software Engineer  10000000            1000

[500 rows x 6 columns]

### Create a new column with rank() function

In [21]:
# rank is given to the salary column default highest rank is given to the highest salary
# but if we want highest rank for lower salary the give ascending = False
df1['rank'] = df1.salary.rank()
df1

      ID       Name   Age         Profession    salary  updated_salary   rank
0      1     olivia  23.0            Teacher  10000000            1000  250.5
1      2  sophia     20.0              Boxer  10000000            1000  250.5
2      3       jake  38.0          Scientist  10000000            1000  250.5
3      4      Rocky  56.0               Chef  10000000            1000  250.5
4      4      Rocky  56.0               Chef  10000000            1000  250.5
..   ...        ...   ...                ...       ...             ...    ...
495  496       John  45.0              Boxer  10000000            1000  250.5
496  497   Sherlock  46.0              Boxer  10000000            1000  250.5
497  498   Sherlock  47.0          Detective  10000000            1000  250.5
498  499     Olivia  55.0           Comedian  10000000            1000  250.5
499  500   Sherlock  59.0  Software Engineer  10000000            1000  250.5

[500 rows x 7 columns]

In [34]:
df['salary_rank_ascending'] = df.salary.rank() # higher salary will get highest rank
df

      ID       Name   Age         Profession  salary  salary_rank_ascending
0      1     olivia  23.0            Teacher  184518                  462.0
1      2  sophia     20.0              Boxer  119572                  267.0
2      3       jake  38.0          Scientist  174897                  426.0
3      4      Rocky  56.0               Chef  117920                  251.0
4      4      Rocky  56.0               Chef  117920                  251.0
..   ...        ...   ...                ...     ...                    ...
495  496       John  45.0              Boxer  137929                  320.0
496  497   Sherlock  46.0              Boxer   39870                   36.0
497  498   Sherlock  47.0          Detective  165951                  395.0
498  499     Olivia  55.0           Comedian  192618                  480.0
499  500   Sherlock  59.0  Software Engineer  194886                  487.0

[500 rows x 6 columns]

In [35]:
df['salary_rank_descending'] = df.salary.rank(ascending = False) # Lower salary will get highest rank
df

,ID,Name,Age,Profession,salary,salary_rank_ascending,salary_rank_descending
0,1,olivia,23.0,Teacher,184518,462.0,39.0
1,2,sophia,20.0,Boxer,119572,267.0,234.0
2,3,jake,38.0,Scientist,174897,426.0,75.0
3,4,Rocky,56.0,Chef,117920,251.0,250.0
4,4,Rocky,56.0,Chef,117920,251.0,250.0
...,...,...,...,...,...,...,...
495,496,John,45.0,Boxer,137929,320.0,181.0
496,497,Sherlock,46.0,Boxer,39870,36.0,465.0
497,498,Sherlock,47.0,Detective,165951,395.0,106.0
498,499,Olivia,55.0,Comedian,192618,480.0,21.0
499,500,Sherlock,59.0,Software Engineer,194886,487.0,14.0

In [36]:
df1.sort_values('rank')

      ID      Name   Age         Profession    salary  updated_salary   rank
495  496      John  45.0              Boxer  10000000            1000  250.5
494  495     Rocky  27.0             Doctor  10000000            1000  250.5
493  494    Sophia  39.0             Doctor  10000000            1000  250.5
492  493      John  55.0             Artist  10000000            1000  250.5
491  492      Emma  34.0             Artist  10000000            1000  250.5
..   ...       ...   ...                ...       ...             ...    ...
16    17      Jake  46.0             Artist  10000000            1000  250.5
497  498  Sherlock  47.0          Detective  10000000            1000  250.5
498  499    Olivia  55.0           Comedian  10000000            1000  250.5
499  500  Sherlock  59.0  Software Engineer  10000000            1000  250.5
0      1    olivia  23.0            Teacher  10000000            1000  250.5

[500 rows x 7 columns]

In [43]:
df.sort_values('salary_rank_descending')

,ID,Name,Age,Profession,salary,salary_rank_ascending,salary_rank_descending
436,437,Sherlock,52.0,Boxer,199529,500.0,1.0
65,66,Emma,57.0,Pilot,199317,499.0,2.0
132,133,Rocky,31.0,Doctor,198978,498.0,3.0
167,168,Mr. Bean,44.0,Comedian,198847,497.0,4.0
474,475,Sophia,30.0,Doctor,198653,496.0,5.0
...,...,...,...,...,...,...,...
284,285,Jake,46.0,Detective,30971,5.0,496.0
329,330,Sherlock,40.0,Scientist,30905,4.0,497.0
398,399,Rocky,25.0,Scientist,30659,3.0,498.0
90,91,Rocky,43.0,Software Engineer,30407,2.0,499.0
213,214,Sherlock,21.0,Chef,30164,1.0,500.0

### Delete a column from the database

In [44]:
df = df.drop(['salary_rank_ascending','salary_rank_descending'],axis = 1)

In [45]:
df

      ID       Name   Age         Profession  salary
0      1     olivia  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500   Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [48]:
df1 = df1.drop(['rank','salary','updated_salary'],axis = 1)

In [49]:
df1

      ID       Name   Age         Profession
0      1     olivia  23.0            Teacher
1      2  sophia     20.0              Boxer
2      3       jake  38.0          Scientist
3      4      Rocky  56.0               Chef
4      4      Rocky  56.0               Chef
..   ...        ...   ...                ...
495  496       John  45.0              Boxer
496  497   Sherlock  46.0              Boxer
497  498   Sherlock  47.0          Detective
498  499     Olivia  55.0           Comedian
499  500   Sherlock  59.0  Software Engineer

[500 rows x 4 columns]

In [50]:
df.Name.unique()

array(['olivia', 'sophia   ', 'jake', 'Rocky', 'Jake', 'Olivia', 'John',
       'Sherlock', 'Alice', 'Mr. Bean', 'Sophia', 'Liam', 'Emma'],
      dtype=object)

In [51]:
df.Profession.unique()

array(['Teacher', '      Boxer', 'Scientist', 'Chef', 'Doctor', 'Artist',
       'Comedian', 'Software Engineer', 'Detective', 'Pilot'],
      dtype=object)

### Replace a specific value in the dataset

In [52]:
df['Name'] = df.Name.replace('olivia','Riya')
df

      ID       Name   Age         Profession  salary
0      1       Riya  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500   Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [53]:
df['Name'] = df.Name.replace('Olivia','Sam')
df

      ID       Name   Age         Profession  salary
0      1       Riya  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499        Sam  55.0           Comedian  192618
499  500   Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

### Datatypes

In [54]:
df.dtypes

ID              int64
Name           object
Age           float64
Profession     object
salary          int64
dtype: object

### Datatype Conversion

In [55]:
df['Name'] = df.Name.astype("string")
df.dtypes

ID                     int64
Name          string[python]
Age                  float64
Profession            object
salary                 int64
dtype: object

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          500 non-null    int64
 1   Name        500 non-null    string
 2   Age         492 non-null    float64
 3   Profession  500 non-null    object
 4   salary      500 non-null    int64
dtypes: float64(1), int64(2), object(1), string(1)
memory usage: 19.7+ KB

In [58]:
# Selecting columns based upon datatype
df.select_dtypes(include = ['object','string'])

          Name         Profession
0         Riya            Teacher
1    sophia                 Boxer
2         jake          Scientist
3        Rocky               Chef
4        Rocky               Chef
..         ...                ...
495       John              Boxer
496   Sherlock              Boxer
497   Sherlock          Detective
498        Sam           Comedian
499   Sherlock  Software Engineer

[500 rows x 2 columns]

In [59]:
df.select_dtypes(include = ['int64','float64'])

      ID   Age  salary
0      1  23.0  184518
1      2  20.0  119572
2      3  38.0  174897
3      4  56.0  117920
4      4  56.0  117920
..   ...   ...     ...
495  496  45.0  137929
496  497  46.0   39870
497  498  47.0  165951
498  499  55.0  192618
499  500  59.0  194886

[500 rows x 3 columns]

In [61]:
# Describe the statistical information about the data
df.describe()

               ID         Age         salary
count  500.000000  492.000000     500.000000
mean   250.458000   40.810976  115602.828000
std    144.552978   11.790553   49404.366846
min      1.000000   20.000000   30164.000000
25%    125.750000   31.000000   74964.750000
50%    250.500000   40.500000  117920.000000
75%    375.250000   51.000000  160579.500000
max    500.000000   60.000000  199529.000000

In [63]:
df.describe(include = ['string','object'])

            Name Profession
count        500        500
unique        13         10
top     Sherlock       Chef
freq          61         58

In [64]:
df.describe(include = 'all')

                ID      Name         Age Profession         salary
count   500.000000       500  492.000000        500     500.000000
unique         NaN        13         NaN         10            NaN
top            NaN  Sherlock         NaN       Chef            NaN
freq           NaN        61         NaN         58            NaN
mean    250.458000       NaN   40.810976        NaN  115602.828000
std     144.552978       NaN   11.790553        NaN   49404.366846
min       1.000000       NaN   20.000000        NaN   30164.000000
25%     125.750000       NaN   31.000000        NaN   74964.750000
50%     250.500000       NaN   40.500000        NaN  117920.000000
75%     375.250000       NaN   51.000000        NaN  160579.500000
max     500.000000       NaN   60.000000        NaN  199529.000000